app/controllers/team_controller.rb

  def show

    # res.header('Access-Control-Allow-Origin', 'http://localhost:4000');
    # res.header('Access-Control-Allow-Methods', 'GET');
    @team = Team.find(params[:id])
    @resources = @team.resources.order(updated_at: :asc)
    @players = @team.users.where(coach: false)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "resources".* FROM "resources" WHERE "resources"."team_id" = $1  ORDER BY "resources"."updated_at" ASC  [["team_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."team_id" = $1 AND "users"."coach" = $2  [["team_id", 1], ["coach", "f"]]

  def create_google_auth
    @team = Team.find(1)
    @resources = @team.resources.order(updated_at: :asc)
    @players = @team.users.where(coach: false)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "resources".* FROM "resources" WHERE "resources"."team_id" = $1  ORDER BY "resources"."updated_at" ASC  [["team_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."team_id" = $1 AND "users"."coach" = $2  [["team_id", 1], ["coach", "f"]]